app/controllers/venues_controller.rb

SELECT "venues".* FROM "venues" ORDER BY position ASC
---
  def index
    @venues = Venue.includes(:options).all

SELECT "venues".* FROM "venues" WHERE ("venues"."id" = 1) LIMIT 1
---
  def show
    @venue = Venue.includes(:options).find(params[:id])